%% %%%%%%%%%%%%%% 时变功能函数的MCS求解 %%%%%%%%%%%%%%%%%%%%%%
% %%%%%%%% 考虑以下的时变功能函数, 时间观察域 0:5 %%%%%%%%
clear, clc;
% t = (0:0.01:5);
% mu_ = [3.5, 3.5];    sigma_d = [0.3, 0.3]; sigma_ = diag(sigma_d.^2);
% g = @(x, t) x(:,1).^2 .* x(:,2) - 5 .* x(:,1) .* t + (x(:,2) + 1) .* t.^2 - 20;

%% %%%%%%%%%% 四连杆机构的可靠性分析 %%%%%%%%%%%%%%%%%%%%%%%%%%%
mu_ = [53, 122, 66.5,  100]; sigma_d = [0.1, 0.1, 0.1, 0.1]; sigma_ = diag(sigma_d.^2);

t = deg2rad(95.5:0.6:155.5);
D = @(x,t) -2 .* x(:,1) .* x(:,3) .*sin(t);
E = @(x,t) 2 * x(:,3) .*((x(:,4) - x(:,1) .* cos(t)));
F = @(x,t) x(:,2).^2 - x(:,1).^2 - x(:,3).^2 - x(:,4).^2 + 2 .* x(:,1) .* x(:,4) .* cos(t);
g = @(x,t) deg2rad(0.8) - abs((deg2rad(76) + deg2rad(60) .* sin(3./4.* (t - deg2rad(95.5))) -2.* atan((D(x,t) + sqrt(D(x,t).^2 + E(x,t).^2 - F(x,t).^2))./(E(x,t)+ F(x,t)))));

num_MCS = 2^16;
pf = time_MCS(mu_, sigma_, g, t, num_MCS);


