clear, clc;
%%%%%%%%%%%%%%%%%%%%%%% Example 2.6 %%%%%%%%%%%%%%%%%%%%%%%%%%
% 对于两个参数的可靠性灵敏度分析, 其中失效概率函数定义为:
% g(x) = exp(0.2 X1 + 1.4) - X2; 其中X1, X2相互独立且服从于标准正态分布

g = @(x) exp(0.2 .*x(:,1) + 1.4) - x(:,2);
mu_ = [0,0]; sigma_ = diag([1^2,1^2]); skewness_ = [0,0]; kurtosis_ = [3,3]; % 由于相互独立协方差是0 
% 注意sigma是一个矩阵, 同时提供了方差和协方差部分;

%%%%%%%%%%%%%%%%%%%%%%% Example 2.7 %%%%%%%%%%%%%%%%%%%%%%%%%%
% 某内压圆筒型容器材料为15MnV, 随机变量取为内径D, 内压强P, 壁厚t与屈服强度sigma_s
% 这些随机变量独立且均服从正态分布, 参数在下面给出
% g = @(x)x(:,4) - x(:,2) .* x(:, 1)./(2 .* x(:,3));  % 失效概率函数
% mu_= [460, 20, 19, 392]; sigma_ = diag([7^2,2.4^2, 0.8^2, 31.4^2]); skewness_ = [0,0,0,0]; kurtosis_ = [3,3,3,3];

%%%%%%%%%%%%%%%%%%%%%%% Example 2.8 %%%%%%%%%%%%%%%%%%%%%%%%%%
% g1=@(x)2.*x(:,1).^2-x(:,2)+6;
% g2=@(x)x(:,1)+x(:,2).^2-4;
% g=@(x) min([g1(x),g2(x)], [], 2); %功能函数
% mu_=[5 1]; sigma_=diag([1^2, 0.1^2]); skewness_=[0 0]; kurtosis_=[3 3]; %输入变量均值、标准差、偏度、峰度

%%%%%%%%%%%%%%%%%%%%%%% Example 2.9 %%%%%%%%%%%%%%%%%%%%%%%%%%
% g1=@(x)2.*x(:,1)+2.*x(:,3)-4.5.*x(:,4);
% g2=@(x)2.*x(:,1)+x(:,2)+x(:,3)-4.5.*x(:,4);
% g3=@(x)x(:,1)+x(:,2)+2.*x(:,3)-4.5.*x(:,4);
% g4=@(x)x(:,1)+2.*x(:,2)+x(:,3)-4.5.*x(:,4);
% g=@(x)min([g1(x),g2(x),g3(x),g4(x)], [], 2); %功能函数
% mu_=[2 2 2 1]; sigma_=diag([0.2^2, 0.2^2, 0.2^2, 0.25^2]); skewness_=[0 0 0 0]; kurtosis_=[3 3 3 3]; %输入变量均值、标准差、偏度、峰度

%%%%%%%%%%%%%%%%    MCS 方法求解精确解部分  %%%%%%%%%%%%%%%%%%%%%%%%
[alpha_sens1, alpha_sens2, fp] = MCS_Solution(mu_, sigma_, g);
mu_sen_MCS = [alpha_sens1(1), alpha_sens2(1)];      % 对第一个变量的均值偏导和方差偏导
sigma_sen_MCS = [alpha_sens1(2), alpha_sens2(2)];   % 对第二个变量的均值偏导和方差偏导
disp(vpa([mu_sen_MCS, sigma_sen_MCS, fp],5));

%%%%%%%%%%%%%%%%    三点结合四阶矩的方法    %%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%  使用四阶矩方法结合三点估计获取系统的可靠性和可靠性灵敏度进行分析 %%%
[alpha_sens1_2, alpha_sens2_2, fp2] = FourthStep_Solution(mu_, sigma_, skewness_, kurtosis_, g);
mu_sen_For = [alpha_sens1_2(1), alpha_sens2_2(1)];    % 对第一个变量的均值偏导和方差偏导 
sigma_sen_For = [alpha_sens1_2(2), alpha_sens2_2(2)]; % 对第二个变量的均值偏导和方差偏导
disp(vpa([mu_sen_For, sigma_sen_For, fp2],5));

